# Отчёт по лабораторной работе №12 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Ибрагимов Далгат Магомедалиевич, № по списку 9</ins> 

<b>Контакты e-mail:</b> <ins>doly2004e@yandex.ru</ins>

<b>Работа выполнена:</b> <ins>«16» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5 (отлично)</ins>

<b>Отчет сдан</b> <ins>«3» Декабря 2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________


## 1. Тема
Техника работы с целыми числами. Системы счисления.
## 2. Цель работы
Составить программу на языке Си в целом типе данных, которая для любых допустимых и корректно записанных чисел этого типа в десятичном изображении, поступающих на стандартный ввод программы, выполняет указанное вариантом действие над их значениями.
## 3. Задание (вариант № 9)
Проверить упорядоченность цифр числа по неубыванию.
Нумерация цифр ведётся справа налево.

 
## 4. Оборудование
<b>Процессор:</b> AMD Ryzen 5 5600H (12) @ 3.600GHz<br/>
<b>ОП:</b> 32GiB 3200 MHz LPDDR4<br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0 <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 11 Pro <br/>
<b>Компилятор:</b> GNU Compiler Collection <br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0 <br/>
  
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
0. Пропуск пробелов;
1. Проверка является ли цифрой;
2. Проверка того, что следующая цифра меньше или равна предыдущей;
3. Повторение п. 1-2 для оставшейся части числа;
4. Пропуск пробелов и переход к снова к пункту 1;


## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
```
  #include <stdio.h>
#include <stdbool.h>
#include <ctype.h>
#include <stdlib.h>

#define DBL_LOG102 (3.010299956639811952E-1)
#define INT_WIDTH (32)
#define N (((int) (DBL_LOG102 * (INT_WIDTH - 1) + 1))-1)

typedef enum
{
    OUTSIDE,
    WRONG_WORD_NO
} Conditions;

void check_poryadok(){
    Conditions condition = OUTSIDE;
    for (int ch = getchar(); ch != EOF; ch = getchar())
    {
        switch (condition){
            case OUTSIDE:
                if (isdigit(ch))
                {
                    int temp = ch;
                    int k = 0;
                    while (k <= 10){
                        k++;
                        ch = getchar();
                        if (isdigit(ch)){
                            if (ch > temp){
                                condition = WRONG_WORD_NO;
                                printf("NO");
                                goto wwn;
                            }
                        }else if (ch == ' ' || ch == EOF){
                            break;
                        }
                    }
                    if (ch == EOF || ch == ' '){
                        printf("YES");
                        putchar(ch);
                        continue;
                    }
                }else if ( ch == '-')
                {
                    condition = OUTSIDE;
                    continue;
                }
            wwn:case WRONG_WORD_NO:
                while (ch != ' ' && ch != EOF)
                {
                    ch = getchar();
                }
                if (ch == EOF)
                {
                    putchar(ch);
                    break;
                }
                putchar(ch);
                condition = OUTSIDE;
                continue;
        }
    }
}


int main(){
    check_poryadok();
    return 0;
}
```
Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
PS C:\Users\lock_R\Documents\cc> ./a.exe
12 13 13456 123 321 6543 45 555
NO NO NO NO YES YES NO YES
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 16.11.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Защита работы прошла без замечаний.
## 11. Выводы

Была написана программа на языке на Си, выполняющая указанное вариантом действие над значениями в целом типе данных. В результате выполнения работы, были приобретены навыки для работы с числами в целом типе данных.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
