# Отчёт по лабораторной работе №14 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Ибрагимов Далгат Магомедалиевич, № по списку 9</ins> 

<b>Контакты e-mail:</b> <ins>doly2004e@yandex.ru</ins>

<b>Работа выполнена:</b> <ins>«29» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5 (отлично)</ins>

<b>Отчет сдан</b> <ins>«3» Декабря 2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________
# 1. Тема
Вложенные циклы с параметрами. Обход и линеаризация матриц.
## 2. Цель работы
Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода) с помощью вложенных циклов с переменными границами.
## 3. Задание (вариант № 9)
```
 7 13 14 16
 6  8 12 15
 2  5  9 11
 1  3  4 10
```
## 4. Оборудование
<b>Процессор:</b> AMD Ryzen 5 5600H (12) @ 3.600GHz<br/>
<b>ОП:</b> 32GiB 3200 MHz LPDDR4<br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0 <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Microsoft Windows 11 Pro <br/>
<b>Компилятор:</b> GNU Compiler Collection <br/>
<b>Текстовый редактор:</b> Visual Studio Code версия 1.73.0 <br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
1. Ввод размера матрицы; 
2. Создание матрицы;
3. Циклы для прохода по матрице;
4. Вывод ответа.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
```
#include <stdio.h>

const int maxn = 100;
int start(int k,int j){
    if (k>=j){
        return (j-1);
    }else{
        return k;
    }
}

int end(int k, int i){
    if (k>=i){
        return (k-i+1);
    }else{
        return 0;
    }
}
void out(int i, int j, int m[]){
    for (int k = 0; k <= i - 1 + j - 1; k++)
    {
        if (k % 2 != 0){
            for (int j_f = end(k, i); j_f <= start(k, j); j_f++)
            {
                printf("%d ", m[(((i-1) - (k-j_f))*j + j_f)]);
            }
        }else{
            for (int j_f = start(k, j); j_f >= end(k, i); j_f--)
            {
                printf("%d ", m[(((i-1) - (k-j_f))*j + j_f)]);
            }
        }
    }
}
int main()
{
    int i, j;
    int m[maxn*maxn];
    scanf("%d %d", &i, &j);
    for (int k = 0; k != i*j; k++)
    {
        scanf("%d", m + k);
    }
    out(i, j, m);

}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
PS C:\Users\lock_R\Documents\cc> gcc -g lab14.c -pedantic -Wall
PS C:\Users\lock_R\Documents\cc> ./a.exe
4 4
 7 13 14 16
 6  8 12 15
 2  5  9 11
 1  3  4 10
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 
PS C:\Users\lock_R\Documents\cc> ./a.exe
3 4
6 7 11 12
2 5  8 10
1 3  4  9
1 2 3 4 5 6 7 8 9 10 11 12 
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 29.10.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.

Дополнительное задание: вывод по-диагонали-влево-вверх значений под главной диагональю и на ней, вверх-влево-по-диагонали для значений над главной диагональю.
```
 1 15 14 13
 9  2 16 12
 8 10  3 11
 7  6  5  4
```
```
#include <stdio.h>

const int maxn = 100;


void diag(int start, int end, int n, int m[]){
    for (int i = start; i <= end; i = i + (n + 1)){
        printf("%d ",m[i]);
    }
}

void left(int start, int end, int n, int m[]){
    for (int i = end - 1; i > end - end%n + start%n; i--){
        printf("%d ", m[i]);
    }
}

void reverse_left(int start, int end, int n, int m[]){
    for (int i = start + end%n - start%n; i >= start + 1; i--){
        printf("%d ", m[i]);
    }
}

void up(int start, int end, int n, int m[]){
    for (int i = end - end%n + start%n; i >= start + n; i = i - n){
        printf("%d ", m[i]);
    }
}

void reverse_up(int start, int end, int n, int m[]){
    for (int i = end - n; i > start + end%n - start%n; i = i - n){
        printf("%d ", m[i]);
    }
}


int main()
{
    int n;
    //  = 7;
    int m[maxn*maxn];
    // = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49};
    printf("MATRIX SIZE:\n");
    scanf("%d", &n);
    printf("MATRIX:\n");
    for (int k = 0; k != n*n; k++)
    {
        scanf("%d", m + k);
    }
    int start = 0;
    int end = n*n-1;
    while (start != end){
        diag(start, end, n, m);
        left(start, end, n, m);
        up(start, end, n, m);
        start = start + (2*n + 1);
        end = end - (n + 2);
    }
    printf("%d ", m[start]);
    start = 0;
    end = n*n-1;
    while (start != end){
        if (start != 0){
            diag(start, end, n, m);
        }
        reverse_up(start, end, n, m);
        reverse_left(start, end, n, m);
        start = start + (n + 2);
        end = end - (2*n + 1);
    }
    printf("%d ", m[start]);
}



// 1       15      14      13
// 9       2       16      12
// 8       10      3       11
// 7       6       5       4


// 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 
```

## 11. Выводы

Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и печати в строку всех их элементов.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
